In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
l=['banana',42]
s=pd.Series(l)

# pd.Series()

# when we will adding two DataFrames, it takes two function 
# 1--->Append:-
#                   df=1st var.append(2nd var)
# 2---->concat:-
#                   df=pd.concat([1st var,2nd var])
# if you want ignoring index position then function is:
#            df=pd.concat([1st var,2nd var],ignore_index=True,)
#  when we apply in one axis===> df=pd.concat([1st var,2nd var],axis=1)
# in concating variables are within the square bracket .
# Merging DataFrames:-
#        df=pd.merge(1st var,2nd var,on=" ",how=" ")
# where on is common column and how is ["inner","outer","left","right"]
# when we mergeing variables are within paranthesis,if we take square bracket in inner then it gives error.
#

In [4]:
s

0    banana
1        42
dtype: object

In [5]:
s=pd.Series(l,index=['a','b'])
s

a    banana
b        42
dtype: object

In [6]:
a=np.array(l)
a

array(['banana', '42'], dtype='<U11')

In [7]:
s=pd.Series(a,index=['a','b'])
s

a    banana
b        42
dtype: object

In [8]:
a={
    'a':1,'b':2,'c':3
}
pd.Series(a)

a    1
b    2
c    3
dtype: int64

In [9]:
pd.Series(a,index=['a','c'])

a    1
c    3
dtype: int64

In [10]:
d={
    'col1':[1,2],'col2':[3,4]
}
df=pd.Series(d)

In [11]:
df

col1    [1, 2]
col2    [3, 4]
dtype: object

In [12]:
# Data Frame---->pd.DataFrame
d={
    'col1':[1,2],'col2':[3,4]
}
pd.DataFrame(d)

   col1  col2
0     1     3
1     2     4

In [13]:
a=np.array([[1,2,3],[4,5,6]])
df=pd.DataFrame(a)             # 2D array
df

   0  1  2
0  1  2  3
1  4  5  6

In [14]:
s=np.array([[1,2,3],[9,8,7]])
df=pd.DataFrame(s)
df

   0  1  2
0  1  2  3
1  9  8  7

In [15]:
df=pd.DataFrame(s,columns=["col1","col2","col3"])   #columns
df

   col1  col2  col3
0     1     2     3
1     9     8     7

In [16]:
d=[[1,2,3],[3,4,5]]
pd.DataFrame(d,columns=["col1","col2","col3"])

   col1  col2  col3
0     1     2     3
1     3     4     5

In [17]:
temperature_df=pd.DataFrame({
    "city":["mumbai","delhi","chennai","hyderabad"],"temperature":[28,18,29,22]
})
temperature_df

        city  temperature
0     mumbai           28
1      delhi           18
2    chennai           29
3  hyderabad           22

In [18]:
mark_df=pd.DataFrame({
    "student":["gita","rahul","goutam","sai","rupali"],"marks":[76,87,67,89,45]
})
mark_df

  student  marks
0    gita     76
1   rahul     87
2  goutam     67
3     sai     89
4  rupali     45

In [19]:
humidity_df=pd.DataFrame({
    "city":["kolkata","jaypur","delhi","bhubaneswar"],"humidity":[68,65,70,78]
})
print(humidity_df,type(humidity_df))

          city  humidity
0      kolkata        68
1       jaypur        65
2        delhi        70
3  bhubaneswar        78 <class 'pandas.core.frame.DataFrame'>

In [20]:
df=temperature_df.append(humidity_df)
df

C:\Users\KIRTI RAJ PRADHAN\AppData\Local\Temp\ipykernel_20576\1704266143.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df=temperature_df.append(humidity_df)

          city  temperature  humidity
0       mumbai         28.0       NaN
1        delhi         18.0       NaN
2      chennai         29.0       NaN
3    hyderabad         22.0       NaN
0      kolkata          NaN      68.0
1       jaypur          NaN      65.0
2        delhi          NaN      70.0
3  bhubaneswar          NaN      78.0

In [21]:
df=pd.concat([temperature_df,humidity_df])
df

          city  temperature  humidity
0       mumbai         28.0       NaN
1        delhi         18.0       NaN
2      chennai         29.0       NaN
3    hyderabad         22.0       NaN
0      kolkata          NaN      68.0
1       jaypur          NaN      65.0
2        delhi          NaN      70.0
3  bhubaneswar          NaN      78.0

In [22]:
df=pd.concat([temperature_df,humidity_df],ignore_index=True)
df

          city  temperature  humidity
0       mumbai         28.0       NaN
1        delhi         18.0       NaN
2      chennai         29.0       NaN
3    hyderabad         22.0       NaN
4      kolkata          NaN      68.0
5       jaypur          NaN      65.0
6        delhi          NaN      70.0
7  bhubaneswar          NaN      78.0

In [23]:
df=pd.concat([temperature_df,humidity_df],axis=1)
df

        city  temperature         city  humidity
0     mumbai           28      kolkata        68
1      delhi           18       jaypur        65
2    chennai           29        delhi        70
3  hyderabad           22  bhubaneswar        78

In [24]:
#merging DataFrames
df=pd.merge(temperature_df,humidity_df,on="city",how="inner")    # it acts like a set theory intersection left for left round and right for right round
df

    city  temperature  humidity
0  delhi           18        70

In [25]:
df=pd.merge(temperature_df,humidity_df,on="city",how="outer")
df

          city  temperature  humidity
0       mumbai         28.0       NaN
1        delhi         18.0      70.0
2      chennai         29.0       NaN
3    hyderabad         22.0       NaN
4      kolkata          NaN      68.0
5       jaypur          NaN      65.0
6  bhubaneswar          NaN      78.0

In [26]:
df=pd.merge(temperature_df,humidity_df,on="city",how="left")
df

        city  temperature  humidity
0     mumbai           28       NaN
1      delhi           18      70.0
2    chennai           29       NaN
3  hyderabad           22       NaN

In [27]:
df=pd.merge(temperature_df,humidity_df,on="city",how="right")
df

          city  temperature  humidity
0      kolkata          NaN        68
1       jaypur          NaN        65
2        delhi         18.0        70
3  bhubaneswar          NaN        78